{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "batch_input_shape": [null, 480, 640, 1], "bias": true, "nb_col": 5, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "name": "convolution2d_1", "nb_filter": 8}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [5, 5], "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [5, 5]}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "nb_filter": 12}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [5, 5], "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [5, 5]}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "name": "convolution2d_3", "nb_filter": 16}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 4480, "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "output_dim": 512}}, {"class_name": "Dense", "config": {"input_dim": 512, "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "output_dim": 256}}, {"class_name": "Dense", "config": {"input_dim": 256, "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_3", "output_dim": 128}}, {"class_name": "Dense", "config": {"input_dim": 128, "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_4", "output_dim": 1}}]}